Repository: Alan86024/nvda-console-toolkit-
Catalog: addon/locale/*/lc_messages/nvda.po
Languages: fi

source: Console Toolkit settings
fi: Konsolityökalun asetukset

source: Speak console output in realtime
fi: Puhu konsolin tuloste reaaliajassa

source: Beep on update in consoles
fi: Anna äänimerkki konsolin päivittyessä

source: Always enable Control+V in console (useful for SSH)
fi: Ota Ctrl+V käyttöön kaikissa konsoleissa (käytännöllinen SSH:ta käytettäessä)

source: Method of deleting lines for prompt editing:
fi: Rivien poistotapa kehotteessa:

source: Suffix to be appendedd to commands in output capturing mode.
fi: Komentoihin lisättävä pääte keräystilassa.

source: Open captured output in
fi: Avaa kerätty tuloste sovelluksessa

source: Capture timeout in seconds:
fi: Keräyksen aikakatkaisu (sekuntia):

source: Volume of chime while capturing command output
fi: Keräysäänimerkin voimakkuus

source: Override shift+numPad7 behavior to take review cursor to the first visible line
fi: Pakota Shift+NumPad7 siirtämään tarkastelukohdistin ensimmäiselle näkyvälle riville

source: Ignore repeated route review cursor events
fi: Älä huomioi peräkkäisiä tarkastelukohdistimen reititystapahtumia

source: Capture timeout must be a positive integer
fi: Keräyksen aikakatkaisun on oltava positiivinen numero

source: Edit text
fi: Muokkaa tekstiä

source: Command output
fi: Komentotuloste

source: Failed to set review positionreveiew
fi: Tarkastelukohdistimen asettaminen epäonnistui:

source: Pasted
fi: Liitetty

source: Edit prompt
fi: Muokkaa kehotetta

source: Opens accessible window that allows to edit current command line prompt.
fi: Avaa saavutettavan ikkunan, jossa voit muokata nykyistä kehotetta.

source: Capture command output
fi: Kerää komentotuloste

source: Executes command, captures output and presents it in accessible window.
fi: Suorittaa komennon, kerää tulosteen ja näyttää sen saavutettavassa ikkunassa.

source: Control character found on the screen; clear window and try again.
fi: Control havaittu näytöllä; tyhjennä ikkuna ja yritä uudelleen.

source: Timed out while waiting for control characters to appear.
fi: Aikakatkaisu odotettaessa.

source: Control+C: works in both cmd.exe and bash, but leaves previous prompt visible on the screen; doesn't work in emacs; sometimes unreliable on slow SSH connections
fi: CONTROL+C: Toimii sekä cmd.exessä että bashissa, mutta jättää aikaisemman komennon näkyväksi näytölle; ei toimi Emacsissa; Joskus epäluotettava hitaissa SSH -yhteyksissä

source: Escape: works only in cmd.exe
fi: Escape: Toimii vain cmd.exessä

source: Control+A Control+K: works in bash and emacs; doesn't work in cmd.exe
fi: CONTROL+A CONTROL+K: Toimii bashissa ja emacsissa; ei toimi cmd.exessä

source: Backspace (recommended): works in all environments; however slower and may cause corruption if the length of the line has changed
fi: Backspace (suositus): Toimii kaikissa ympäristöissä; on Kuitenkin hitaampi ja voi aiheuttaa korruptiota, jos rivin pituus on muuttunut

source: Timed out while waiting for modifiers to be released!
fi: Aikakatkaisu odotettaessa muokkaimien vapautumista!

source: Capture interrupted!
fi: Keräys keskeytetty!

source: Timed out while waiting for command output!
fi: Aikakatkaisu odotettaessa tulostetta!

source: Copy to clipboard
fi: Kopioi leikepöydälle

source: Open in temporary window
fi: Avaa väliaikaisessa ikkunassa

source: Open in Notepad
fi: Avaa Muistiossa

source: Open in Notepad++
fi: Avaa Notepad++:ssa

source: Command output copied to clipboard
fi: Komennon tuloste kopioitu leikepöydälle

source: Console toolkit
fi: Konsolityökalu

source: Console Toolkit
fi: Konsolityökalu

source: Accessibility improvements for Windows console.
fi: Windows -konsolin saavutettavuusparannuksia.
